app/views/today/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 6
---
                <% if meeting.duration_minutes.present? %>· <%= meeting.duration_minutes %> min<% end %>
                <% if meeting.project.present? %> · <%= meeting.project.name %><% end %>