app/views/dashboard/index.html.erb

          <div class="level-right">
            <span class="badge bg-light text-dark"><%= project.tickets.where.not(status: [:done, :closed]).count %> open</span>
---
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."project_id" = 5 AND "tickets"."status" NOT IN (5, 6)