app/views/chat_rooms/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
               style="background:<%= ["#4a90d9","#7b68ee","#20c997","#fd7e14","#e83e8c"].rotate(msg.user_id % 5).first %>;">
            <%= msg.user.display_name.first.upcase %>