app/views/sprints/_sprint_row.html.erb

        <%= sprint.start_date.strftime("%d %b") %> – <%= sprint.end_date.strftime("%d %b %Y") %>
        · <%= sprint.tickets.count %> tickets
---
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."sprint_id" = ?  [["sprint_id", 1]]