app/views/tickets/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
          <div class="select w-100">
            <%= f.select :owner_id, User.order(:name).map { |u| [u.display_name, u.id] }, { include_blank: "— None —" } %>

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
          <div class="select w-100">
            <%= f.select :assignee_id, User.order(:name).map { |u| [u.display_name, u.id] }, { include_blank: "— Unassigned —" } %>

SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 2
---
          <div class="select w-100">
            <%= f.select :sprint_id, @project.sprints.map { |s| [s.name, s.id] }, { include_blank: "— No Sprint —" } %>