app/views/tickets/_form.html.erb

    <div class="col">
      <%= f.input :milestone_id,
            label: "Milestone",
            collection: @project.milestones.order(:name).map { |m| [m.name, m.id] },
            include_blank: "— No Milestone —",
            input_html: { class: "form-select" } %>
---
SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = ? ORDER BY "milestones"."name" ASC  [["project_id", 1]]