app/views/tickets/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 5 LIMIT 1
---
      <%# Comment form — only for project members %>
      <% is_member = current_user.admin? || @ticket.project.members.include?(current_user) %>