app/views/documents/index.html.erb

SELECT "documents".* FROM "documents" WHERE "documents"."project_id" = 3 ORDER BY "documents"."updated_at" DESC
---
      <i class="bi bi-file-earmark-code me-1"></i>Templates
      <% count = @project.documents.templates.count %>