app/views/projects/show.html.erb

SELECT COUNT(*) FROM "tickets" WHERE "tickets"."project_id" = 3 AND "tickets"."status" NOT IN (5, 6)
---
    <div class="card p-3 mb-3 stat-card">
      <div class="stat-number"><%= @project.tickets.where.not(status: [:done, :closed]).count %></div>

SELECT COUNT(*) FROM "deployments" WHERE "deployments"."project_id" = 3 AND "deployments"."created_at" >= '2026-04-23 05:38:59.699730'
---
    <div class="card p-3 mb-3 stat-card">
      <div class="stat-number"><%= @project.deployments.where(created_at: 30.days.ago..).count %></div>

SELECT COUNT(*) FROM "pull_requests" WHERE "pull_requests"."project_id" = 3 AND "pull_requests"."status" = 0
---
    <div class="card p-3 mb-3 stat-card">
      <div class="stat-number"><%= @project.pull_requests.where(status: :open).count %></div>

SELECT COUNT(*) FROM "project_memberships" WHERE "project_memberships"."project_id" = 3
---
    <div class="level-left">
      <h3 class="fw-bold fs-5 mb-0">👥 Members (<%= @project.project_memberships.count %>)</h3>

SELECT "users".* FROM "users" WHERE "users"."id" IN (8, 5, 3)
---

  <% memberships = @project.project_memberships.includes(:user).order(:role, "users.name") %>