app/controllers/api/v1/tickets_controller.rb

INSERT INTO "tickets" ("actual_velocity", "assignee_id", "branch_name", "created_at", "description", "dev_estimate_hours", "how_to_reproduce", "kind", "latest_ci_run_id", "level", "milestone_id", "owner_id", "pr_number", "pr_url", "priority", "project_id", "sprint_id", "status", "story_points", "test_plan", "tester_estimate_hours", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        attrs = params.require(:ticket).permit(
          :project_id, :title, :description, :status, :priority,
          :kind, :level, :how_to_reproduce, :assignee_id,
          :owner_id, :dev_estimate_hours, :tester_estimate_hours
        )

        ticket = Ticket.new(attrs)
        ticket.owner ||= current_api_user

        if ticket.save

UPDATE "tickets" SET "priority" = ?, "status" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["priority", 3], ["status", 2], ["updated_at", "2026-05-23 17:15:18.421748"], ["id", 1]]
---
      def update
        allowed = %w[
          title description status priority kind level how_to_reproduce
          assignee_id owner_id pr_number pr_url dev_estimate_hours tester_estimate_hours
        ]
        attrs   = params.require(:ticket).permit(*allowed)

        if @ticket.update(attrs)