app/controllers/application_controller.rb

  def load_sidebar_data
    # Active projects for sidebar accordion
    @sidebar_projects = Project.active.order(:name)

    # Latest CI run per project (by highest id = most recent insertion)
    latest_ci_ids = CiRun.select("MAX(id) as id").group(:project_id).map(&:id)
    @sidebar_latest_ci = CiRun.where(id: latest_ci_ids).index_by(&:project_id)

    # Latest deployment per project
    latest_deploy_ids = Deployment.select("MAX(id) as id").group(:project_id).map(&:id)
    @sidebar_latest_deploy = Deployment.where(id: latest_deploy_ids).index_by(&:project_id)

    # Open PR counts per project
    @sidebar_open_prs = PullRequest.where(status: :open).group(:project_id).count

    # Canonical docs per project for sidebar links (risk, backlog, test plan)
    sidebar_doc_types = %w[risk_management user_story test_coverage]
    @sidebar_project_docs = Document
      .where(project_id: @sidebar_projects.map(&:id), doc_type: sidebar_doc_types)
      .index_by { |d| "#{d.project_id}-#{d.doc_type}" }

    # Chat rooms for sidebar channel list
    @sidebar_chat_rooms = ChatRoom.active.includes(:project).order(:room_type, :name)

    # Right panel: 15 most recent notifications
    @panel_notifications = current_user.notifications
                                       .order(created_at: :desc)
                                       .limit(15)

    # Right panel: recent CI runs + deployments combined into activity feed
    recent_ci      = CiRun.includes(:project).order(updated_at: :desc).limit(8)
    recent_deploys = Deployment.includes(:project).order(updated_at: :desc).limit(8)
---
SELECT MAX(id) as id FROM "ci_runs" GROUP BY "ci_runs"."project_id"
SELECT MAX(id) as id FROM "deployments" GROUP BY "deployments"."project_id"
SELECT COUNT(*) AS "count_all", "pull_requests"."project_id" AS "pull_requests_project_id" FROM "pull_requests" WHERE "pull_requests"."status" = 0 GROUP BY "pull_requests"."project_id"
SELECT "ci_runs".* FROM "ci_runs" ORDER BY "ci_runs"."updated_at" DESC LIMIT 8
SELECT "deployments".* FROM "deployments" ORDER BY "deployments"."updated_at" DESC LIMIT 8