app/controllers/chat_rooms_controller.rb

  def show
    @messages = @chat_room.chat_messages
                           .includes(:user)
                           .recent
                           .last(100)
---
SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."chat_room_id" = 9 ORDER BY "chat_messages"."created_at" DESC LIMIT 100

  def new
    @chat_room = ChatRoom.new
    @projects  = Project.active.order(:name)
---
SELECT "projects".* FROM "projects" WHERE "projects"."active" = TRUE ORDER BY "projects"."name" ASC

  def create
    @chat_room = ChatRoom.new(chat_room_params)
    if @chat_room.save
---
INSERT INTO "chat_rooms" ("archived", "created_at", "description", "name", "project_id", "room_type", "updated_at") VALUES (FALSE, '2026-05-22 19:25:15.201209', 'aaa', 'aaaaa', NULL, 1, '2026-05-22 19:25:15.201209') RETURNING "id"