app/controllers/ci_runs_controller.rb

  def index
    @ci_runs = @project.ci_runs
                       .includes(:triggered_by, :test_results)
                       .order(created_at: :desc)
                       .limit(50)
---
SELECT "ci_runs".* FROM "ci_runs" WHERE "ci_runs"."project_id" = 5 ORDER BY "ci_runs"."created_at" DESC LIMIT 50