app/controllers/comments_controller.rb

  def create
    @comment = @ticket.comments.build(
      body:   params[:comment][:body].to_s.strip,
      author: current_user
    )

    if @comment.body.blank?
      redirect_to @ticket, alert: "Comment cannot be blank"
      return
    end

    if @comment.save
---
INSERT INTO "comments" ("author_id", "body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["author_id", 1], ["body", "Great work!"], ["commentable_id", 1], ["commentable_type", "Ticket"], ["created_at", "2026-05-23 05:56:15.513677"], ["updated_at", "2026-05-23 05:56:15.513677"]]

  def set_ticket
    @ticket  = Ticket.includes(:project).find(params[:ticket_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]