app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."project_id" = 3 ORDER BY "documents"."updated_at" DESC
SELECT "documents".* FROM "documents" WHERE "documents"."project_id" = 3 AND "documents"."doc_type" = 5 ORDER BY "documents"."updated_at" DESC
---
  def index
    @documents = @project.documents.includes(:author)
    @documents = @documents.where(doc_type: params[:doc_type]) if params[:doc_type].present?
    @documents = @documents.order(updated_at: :desc)
    @grouped   = @documents.group_by(&:doc_type)

SELECT "documents".* FROM "documents" WHERE "documents"."id" = 11 LIMIT 1
---
  def set_document
    @document = @project.documents.find(params[:id])