app/controllers/meetings_controller.rb

SELECT "meetings".* FROM "meetings" ORDER BY "meetings"."scheduled_at" DESC
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)
---
  def index
    @meetings = (@project&.meetings || Meeting)
                .includes(:organizer, :project)
                .order(scheduled_at: :desc)