app/controllers/notifications_controller.rb

  def mark_read
    notification = current_user.notifications.find(params[:id])
    notification.update(read_at: Time.current)
---
UPDATE "notifications" SET "read_at" = '2026-05-23 05:29:02.220532', "updated_at" = '2026-05-23 05:29:02.220927' WHERE "notifications"."id" = 17