app/controllers/projects_controller.rb

  def index
    @projects = Project.order(:name)
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."name" ASC

  def show
    ticket_ids = @project.tickets.select(:id)
    @recent_comments = Comment
                         .includes(:author, :commentable)
                         .where(commentable_type: "Ticket", commentable_id: ticket_ids)
                         .order(created_at: :desc)
                         .limit(8)
    @recent_ci_runs     = @project.ci_runs.includes(:triggered_by).order(created_at: :desc).limit(5)
    @recent_deployments = @project.deployments.includes(:deployed_by).order(created_at: :desc).limit(5)
    @open_pull_requests = @project.pull_requests.where(status: :open).order(updated_at: :desc).limit(5)
    @recent_documents   = @project.documents.order(updated_at: :desc).limit(6)
    @open_tickets       = @project.tickets.where.not(status: [ :done, :closed ]).includes(:assignee).order(updated_at: :desc).limit(8)
---
SELECT "documents".* FROM "documents" WHERE "documents"."project_id" = 3 ORDER BY "documents"."updated_at" DESC LIMIT 6
SELECT "ci_runs".* FROM "ci_runs" ORDER BY "ci_runs"."updated_at" DESC LIMIT 8
SELECT "deployments".* FROM "deployments" ORDER BY "deployments"."updated_at" DESC LIMIT 8
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 3 AND "tickets"."status" NOT IN (5, 6) ORDER BY "tickets"."updated_at" DESC LIMIT 8

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("active", "created_at", "default_branch", "description", "gitea_repo_id", "name", "repo_url", "tech_stack", "updated_at") VALUES (FALSE, '2026-05-22 19:20:37.238209', 'main', 'sdsds', '', 'demo', '', '', '2026-05-22 19:20:37.238209') RETURNING "id"

  def calendar_events
    range_start = params[:start]&.to_datetime
    range_end   = params[:end]&.to_datetime
    events = []

    # Meetings
    meetings = @project.meetings
    meetings = meetings.where(scheduled_at: range_start..range_end) if range_start && range_end
    meetings.each do |m|
      duration = (m.duration_minutes || 60).minutes
      events << {
        id:    "meeting-#{m.id}",
        title: m.title,
        start: m.scheduled_at&.iso8601,
        end:   m.scheduled_at ? (m.scheduled_at + duration).iso8601 : nil,
        url:   meeting_path(m),
        color: "#4a90d9",
        extendedProps: { type: "meeting" }
      }
    end

    # Milestones
    milestones = @project.milestones
    milestones = milestones.where(due_date: range_start..range_end) if range_start && range_end
    milestones.each do |ms|
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."project_id" = 5 AND "meetings"."scheduled_at" BETWEEN '2026-04-25 21:00:00' AND '2026-06-06 21:00:00'
SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = 5 AND "milestones"."due_date" BETWEEN '2026-04-26' AND '2026-06-07'

    end

    # Sprints
    @project.sprints.each do |s|
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 5