app/controllers/projects_controller.rb

SELECT MAX(id) as id FROM "ci_runs" GROUP BY "ci_runs"."project_id"
SELECT MAX(id) as id FROM "deployments" GROUP BY "deployments"."project_id"
---
  def show
    ticket_ids = @project.tickets.select(:id)
    @recent_comments = Comment
                         .includes(:author, :commentable)
                         .where(commentable_type: "Ticket", commentable_id: ticket_ids)
                         .order(created_at: :desc)
                         .limit(8)
    @recent_ci_runs     = @project.ci_runs.includes(:triggered_by).order(created_at: :desc).limit(5)
    @recent_deployments = @project.deployments.includes(:deployed_by).order(created_at: :desc).limit(5)
    @open_pull_requests = @project.pull_requests.where(status: :open).order(updated_at: :desc).limit(5)
    @recent_documents   = @project.documents.order(updated_at: :desc).limit(6)

    # Tickets panel — filterable between open, completed, and awaiting estimation.
    not_closed = @project.tickets.where.not(status: [ :done, :closed ])