app/controllers/reports_controller.rb

  def ci_summary
    ci_runs_scope = CiRun.includes(:project)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)
SELECT MAX(id) as id FROM "ci_runs" GROUP BY "ci_runs"."project_id"

  def deployment_summary
    deployments_scope = Deployment.includes(:project)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)
SELECT MAX(id) as id FROM "deployments" GROUP BY "deployments"."project_id"

  def test_coverage
    results = TestResult.includes(ci_run: :project).to_a
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)

  def sprint_velocity
    sprints_scope = Sprint.includes(:project, :tickets)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)