app/controllers/sprint_comments_controller.rb

INSERT INTO "comments" ("author_id", "body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["author_id", 1], ["body", "Great progress!"], ["commentable_id", 1], ["commentable_type", "Sprint"], ["created_at", "2026-05-23 06:28:33.538793"], ["updated_at", "2026-05-23 06:28:33.538793"]]
---
  def create
    @comment = @sprint.comments.build(
      body:   params[:comment][:body].to_s.strip,
      author: current_user
    )

    if @comment.body.blank?
      redirect_to @sprint, alert: "Comment cannot be blank"
      return
    end

    if @comment.save

SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_sprint
    @sprint = Sprint.find(params[:sprint_id])