app/controllers/sprints_controller.rb

  def show
    @tickets = @sprint.tickets.includes(:assignee, :owner, :tasks).order(:status, :priority).to_a

    # Top-tile totals
    @done_count    = @tickets.count { |t| %w[done closed].include?(t.status) }
    @progress      = @sprint.progress_percent
    @bug_count     = @tickets.count { |t| %w[bug_fix hotfix].include?(t.kind) }

    # Tickets tabs: open / completed / needs estimation
    @tab = params[:tab].presence_in(%w[open completed needs_estimation]) || "open"
    not_closed = @tickets.reject { |t| %w[done closed].include?(t.status) }
    @tab_tickets = case @tab
    when "completed"        then @tickets.select { |t| %w[done closed].include?(t.status) }
    when "needs_estimation" then not_closed.select { |t| t.story_points.blank? || t.dev_estimate_hours.blank? }
    else                         not_closed
    end
    @tab_counts = {
      "open"            => not_closed.size,
      "completed"       => @tickets.size - not_closed.size,
      "needs_estimation" => not_closed.count { |t| t.story_points.blank? || t.dev_estimate_hours.blank? }
    }

    @meetings      = @sprint.meetings.order(:scheduled_at)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."sprint_id" = ? ORDER BY "tickets"."status" ASC, "tickets"."priority" ASC  [["sprint_id", 1]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."sprint_id" = ? AND "tickets"."status" IN (?, ?)  [["sprint_id", 1], ["status", 5], ["status", 6]]
SELECT "meetings".* FROM "meetings" WHERE "meetings"."sprint_id" = ? ORDER BY "meetings"."scheduled_at" ASC  [["sprint_id", 1]]

  def create
    @sprint = @project.sprints.build(sprint_params)
    if @sprint.save
---
INSERT INTO "sprints" ("created_at", "end_date", "goals", "name", "project_id", "start_date", "status", "things_that_went_right", "things_to_improve", "updated_at", "velocity") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_as_planning
    @sprint.update!(status: :planning)
---
UPDATE "sprints" SET "name" = ?, "updated_at" = ? WHERE "sprints"."id" = ?  [["name", "Updated Sprint"], ["updated_at", "2026-05-23 06:28:33.515161"], ["id", 1]]

  def destroy
    @project = @sprint.project
    @sprint.destroy
---
DELETE FROM "sprints" WHERE "sprints"."id" = ?  [["id", 1]]

  def set_sprint
    @sprint  = Sprint.find(params[:id])
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]