app/controllers/tickets_controller.rb

  def index
    @tickets = @project.tickets.includes(:assignee, :sprint, :ci_runs).order(priority: :desc, created_at: :desc)
    @tickets = @tickets.where(status: params[:status]) if params[:status].present?
    @tickets = @tickets.where(assignee: current_user) if params[:mine] == "true"
    @tickets = @tickets.tagged_with(params[:tag]) if params[:tag].present?
---
SELECT "ci_runs".* FROM "ci_runs" WHERE "ci_runs"."ticket_id" IN (9, 10, 8, 6, 7)
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 2 ORDER BY "tickets"."priority" DESC, "tickets"."created_at" DESC
SELECT "ci_runs".* FROM "ci_runs" WHERE "ci_runs"."ticket_id" = 8 ORDER BY "ci_runs"."created_at" DESC LIMIT 1
SELECT "sprints".* FROM "sprints" INNER JOIN "projects" ON "projects"."id" = "sprints"."project_id" INNER JOIN "project_memberships" ON "projects"."id" = "project_memberships"."project_id" WHERE "sprints"."status" = ? AND (start_date <= ? AND end_date >= ?) AND "project_memberships"."user_id" = ? ORDER BY "sprints"."id" ASC LIMIT ?  [["status", 1], [nil, "2026-05-23"], [nil, "2026-05-23"], ["user_id", 1], ["LIMIT", 1]]
SELECT MAX(id) as id FROM "ci_runs" GROUP BY "ci_runs"."project_id"

  def create
    @ticket = @project.tickets.build(ticket_params)

    if @ticket.save
---
INSERT INTO "tickets" ("actual_hours", "actual_velocity", "assignee_id", "branch_name", "created_at", "description", "dev_estimate_hours", "estimated_by_id", "how_to_reproduce", "kind", "latest_ci_run_id", "level", "milestone_id", "owner_id", "pr_number", "pr_url", "priority", "project_id", "sprint_id", "status", "story_points", "test_plan", "tester_estimate_hours", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    old_assignee_id = @ticket.assignee_id
    if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "dev_estimate_hours" = ?, "estimated_by_id" = ?, "tester_estimate_hours" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["dev_estimate_hours", 4.5], ["estimated_by_id", 1], ["tester_estimate_hours", 2.0], ["updated_at", "2026-05-23 18:46:08.446618"], ["id", 1]]