app/controllers/today_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (5, 3, 1, 2, 4)
SELECT "ci_runs".* FROM "ci_runs" WHERE "ci_runs"."triggered_by_id" = 1 AND "ci_runs"."status" = 3 ORDER BY "ci_runs"."created_at" DESC LIMIT 5
---
  def index
    today     = Time.current.beginning_of_day..Time.current.end_of_day
    yesterday = 1.day.ago.beginning_of_day..1.day.ago.end_of_day

    # ── Active tickets assigned to me ────────────────────────────────────────
    @my_active_tickets = current_user.assigned_tickets
                           .where.not(status: %i[done closed])
                           .includes(:project, :sprint)
                           .order(priority: :desc, updated_at: :desc)

    # Tickets I touched today (updated, commented, or status changed)
    @tickets_updated_today = current_user.assigned_tickets
                               .where(updated_at: today)
                               .includes(:project)
                               .order(updated_at: :desc)

    # ── Documents ─────────────────────────────────────────────────────────────
    # Documents created or updated today on any project I'm active in
    my_project_ids = current_user.assigned_tickets.select(:project_id).distinct
    @documents_today = Document.where(project_id: my_project_ids)
                         .where(updated_at: today)
                         .includes(:project, :author)
                         .order(updated_at: :desc)
                         .limit(10)

    # ── CI Runs I triggered today ─────────────────────────────────────────────
    @my_ci_runs_today = CiRun.where(triggered_by: current_user, started_at: today)
                          .or(CiRun.where(triggered_by: current_user, created_at: today))
                          .includes(:project, :ticket, :test_results)
                          .order(created_at: :desc)

    # Latest still-failing build per project (my runs)
    @my_failing_builds = CiRun.where(triggered_by: current_user, status: :failed)
                           .includes(:project)
                           .order(created_at: :desc)
                           .first(5)

SELECT DISTINCT "meetings".* FROM "meetings" INNER JOIN "meeting_attendees" ON "meeting_attendees"."meeting_id" = "meetings"."id" WHERE "meetings"."scheduled_at" BETWEEN '2026-05-21 21:00:00' AND '2026-05-22 20:59:59.999999' AND "meetings"."status" != 3 AND ("meeting_attendees"."user_id" = 1 OR "meetings"."organizer_id" = 1) ORDER BY "meetings"."scheduled_at" ASC
---
                              .order(created_at: :desc)

    # ── Meetings today ────────────────────────────────────────────────────────
    @meetings_today = Meeting.joins(:meeting_attendees)
                       .where(meeting_attendees: { user_id: current_user.id })
                       .where(scheduled_at: today)
                       .where.not(status: :cancelled)
                       .includes(:project, :organizer)
                       .order(:scheduled_at)
                       .or(
                         Meeting.where(organizer: current_user, scheduled_at: today)
                                .where.not(status: :cancelled)
                                .includes(:project, :organizer)
                                .order(:scheduled_at)
                       )
                       .distinct